/*
ลุงสมหมายได้เปิดร้านของชำเป็นของตัวเอง ด้วยความที่เขามีคอมพิวเตอร์อยู่หนึ่งตัวตั้งทิ้งไว้ เขาจึงคิดว่า คงจะดีมากๆถ้าหน้าจอนั้นมีข้อความแสดงเพื่อต้อนรับลูกค้าของเขา เวลาเดินเข้าร้านจะได้เห็นข้อความต้อนรับนี้ผ่านทางหน้าจอ ดังนั้นแล้วเขาจึงถามคนที่เขารู้จักว่ามีใครบ้างที่สามารถทำโปรแกรมแบบนี้ให้เขาได้ จึงได้มารู้จักเรา และขอให้ทำโปรแกรมที่แสดงข้อความต้อนรับลูกค้าให้เขาหน่อย
(ไม่มีการรับ input และสำหรับข้อความที่ให้แสดงผล ดูได้จากตารางด้านล่าง)

output:
Welcome to Sommai 108 Eleven Shop
*/

console.log('Welcome to Sommai 108 Eleven Shop');

// Dev Lab -> https://school.borntodev.com/course/road-to-back-end-developer-bootcamp/d9dda74e-92fc-4b62-87d8-d20e9387387f/devlab/fcf6b4c2-e048-43bf-bc04-47417943a7c7

// https://www.borntodev.com/devlab/api/tasks/8/share?sharer=68419&passed=0