/*
จากปัจจุบันมีหนึ่งสิ่งที่เกิดขึ้นมาบนโลกแล้วมีความสำคัญกับโลกมากๆ ซึ่งทำให้เราขึ้นไปบนที่สูงได้ง่ายขึ้นนั่นก็คือ 'บันได' นั่นเอง
ซึ่งเด็กหญิงสมจริงที่รักในงานศิลปะเขาสามารถจ้องมองบันไดที่บ้านนิ่ง ๆ โดยไม่ขยับไปไหนได้เป็นชั่วโมงๆ แต่วันหนึ่งป้าสมหมีกลัวว่าเด็กหญิงสมจริงจะตกบันไดที่บ้าน ป้าจึงปิดปรับปรุงบันไดชั่วคราว แต่เด็กหญิงสมจริงนั้นร้องไห้ไม่หยุดเพราะต้องการมองดูบันไดของเขาต่อ
ดังนั้นแล้วเขาจึงให้เราสร้างโปรแกรมเพื่อแสดงรูปบันไดออกมาบนหน้าจอ เด็กหญิงสมจริงจะได้เงียบลงเสียที
(ไม่มีการรับ input และสำหรับข้อความที่ให้แสดงผล ดูได้จากตารางด้านล่าง)

output:
*
**
***
****
*****
******

*/

function stair(step) {
	let star = '';
	for (let i = 0; i < step; i++) {
		for (let j = 0; j <= i; j++) {
			star += '*';
		}
		star += '\n';
	}
	console.log(star);
}

stair(6);

/*
ref -> https://www.tutorialstonight.com/js/javascript-star-pattern

Dev Lab -> https://school.borntodev.com/course/road-to-back-end-developer-bootcamp/d9dda74e-92fc-4b62-87d8-d20e9387387f/devlab/c25af152-8634-46fb-bc46-23ae82704868
*/

// https://www.borntodev.com/devlab/api/tasks/8/share?sharer=68419&passed=0