/*
มื่อลุงสมหมายได้ใช้โปรแกรมของเราที่เคยพัฒนาให้ เขารู้สึกประทับใจในความสามารถมาก จึงไหว้วานเราให้พัฒนาโปรแกรมต่ออีกหนึ่งโปรแกรม เนื่องจากนายสมหมายมี Order ลูกค้าเข้ามาเยอะมาก ไม่สามารถใช้เครื่องคิดเลขได้ เพราะในขณะนั้นเครื่องคิดเลขที่เขาใช้ปุ่มพังไม่สามารถกดได้อีกแล้ว โดยนายสมหมายบอกว่าปกติแล้ว เขากดแค่ปุ่มสำหรับคูณเลขเท่านั้น

เพราะลูกค้ามักซื้อสินค้าประเภทเดียวมากกว่า 1 ชิ้น ถ้าจะให้ซื้อเครื่องคิดเลขใหม่ ปุ่มมันเยอะ เขาบอกว่า

"ลุงใช้ปุ่มทั้งหมดในนั้นไม่ครบ ซื้อมาก็ใช้ไม่คุ้มหรอก"
จึงให้เราพัฒนาโปรแกรมสำหรับคูณเลขขึ้นมา พร้อมทั้งแสดงผลข้อมูลออกมาบนหน้าจอ โดยลุงสมหมายจะทำการกรอกตัวเลขตัวแรกลงไป ซึ่งจะเป็นราคาของสินค้าที่ขาย กับตัวเลขตัวที่สองซึ่งเป็นจำนวนของสินค้าที่ลูกค้าซื้อ ให้เรานำมาคำนวณในการรวมราคาให้กับลุงสมหมาย ถึงแม้ว่าลุงจะไม่ให้ค่าจ้างเราสักบาทก็ตาม ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูจากกรณีทดสอบจากตัวอย่างด้านล่าง
*/

//Get input example
var rl = require("readline").createInterface(process.stdin);
var inputList = [];
rl.on("line", (line) => {inputList.push(line);}).on("close", () => onInput(inputList));

//Code in here
function onInput(inputs) {
  // console.log("input:", inputs.join(','))
  console.log(inputs[0] * inputs[1]);
}

//Tips:  Run for check input format

// Dev Lab -> https://school.borntodev.com/course/road-to-back-end-developer-bootcamp/d9dda74e-92fc-4b62-87d8-d20e9387387f/devlab/29490573-f5c7-4a09-b207-63b8aed4303e